{
  "title": "What are Key Budgeting Concepts?",
  "description": "Learn the framework for planning and controlling financial resources",
  "words": [
    {
      "word": "MASTER",
      "fragments": [
        "MAST",
        "ER"
      ],
      "orientation": "vertical",
      "fact": "The master budget is a comprehensive financial plan that aggregates all individual department and operational budgets. It includes operating budgets (sales, production, expenses) and financial budgets (cash, capital, budgeted financial statements). It coordinates all aspects of the business."
    },
    {
      "word": "FLEXIBLE",
      "fragments": [
        "FLEXI",
        "BLE"
      ],
      "orientation": "vertical",
      "fact": "A flexible budget adjusts for changes in activity levels, showing what costs should be at actual volumes. Unlike static budgets, flexible budgets help analyze performance by separating variances due to volume from variances due to cost control."
    },
    {
      "word": "VARIANCE",
      "fragments": [
        "VARI",
        "ANCE"
      ],
      "orientation": "vertical",
      "fact": "A variance is the difference between budgeted and actual results. Favorable variances improve profit (higher revenue or lower costs), while unfavorable variances reduce profit. Variance analysis helps identify areas needing management attention."
    },
    {
      "word": "FORECAST",
      "fragments": [
        "FOREC",
        "AST"
      ],
      "orientation": "vertical",
      "fact": "Forecasting predicts future financial outcomes based on historical data, trends, and assumptions. Forecasts guide budget preparation and strategic planning. They should be updated regularly as new information becomes available and conditions change."
    },
    {
      "word": "CAPITAL",
      "fragments": [
        "CAPIT",
        "AL"
      ],
      "orientation": "vertical",
      "fact": "Capital budgeting involves evaluating long-term investment projects like equipment purchases or facility expansions. Techniques include Net Present Value (NPV), Internal Rate of Return (IRR), and Payback Period. These decisions significantly impact future cash flows."
    },
    {
      "word": "CASH",
      "fragments": [
        "CA",
        "SH"
      ],
      "orientation": "vertical",
      "fact": "The cash budget projects cash receipts and disbursements over a period, revealing when cash surpluses or shortages will occur. It helps companies plan financing needs, manage working capital, and ensure sufficient liquidity to meet obligations."
    }
  ]
}