{
  "title": "What are Different Types of Assets?",
  "description": "Understand the classification and characteristics of various business assets",
  "words": [
    {
      "word": "CURRENT",
      "fragments": [
        "CURR",
        "ENT"
      ],
      "orientation": "vertical",
      "fact": "Current assets are assets expected to be converted to cash, sold, or consumed within one year or the operating cycle. They include cash, accounts receivable, inventory, and prepaid expenses. Current assets are listed in order of liquidity on the balance sheet."
    },
    {
      "word": "FIXED",
      "fragments": [
        "FIX",
        "ED"
      ],
      "orientation": "vertical",
      "fact": "Fixed assets (or non-current assets) are long-term tangible assets used in business operations for more than one year. They include property, plant, equipment, and land. Fixed assets are not intended for resale and are depreciated over their useful lives (except land)."
    },
    {
      "word": "TANGIBLE",
      "fragments": [
        "TANGI",
        "BLE"
      ],
      "orientation": "vertical",
      "fact": "Tangible assets are physical assets that can be seen and touched. They include buildings, equipment, inventory, and cash. Tangible assets are typically easier to value than intangible assets because they have physical substance and can be observed directly."
    },
    {
      "word": "INTANGIBLE",
      "fragments": [
        "INTANG",
        "IBLE"
      ],
      "orientation": "vertical",
      "fact": "Intangible assets are non-physical assets that provide economic benefits. They include patents, trademarks, copyrights, goodwill, and brand value. Intangible assets are amortized over their useful lives and can be significant sources of competitive advantage."
    },
    {
      "word": "INVENTORY",
      "fragments": [
        "INVENT",
        "ORY"
      ],
      "orientation": "vertical",
      "fact": "Inventory consists of goods held for sale in the ordinary course of business, goods in production, and materials used in production. It's classified as a current asset and valued using methods like FIFO, LIFO, or weighted average cost."
    },
    {
      "word": "RECEIVABLE",
      "fragments": [
        "RECEIV",
        "ABLE"
      ],
      "orientation": "vertical",
      "fact": "Accounts receivable represents money owed to a company by customers for goods or services delivered on credit. It's a current asset that reflects the company's credit sales. Companies must estimate uncollectible accounts (bad debts) and establish an allowance for doubtful accounts."
    }
  ]
}