{
  "title": "What are Product Analytics Concepts?",
  "description": "Understand the terminology used to measure and analyze product performance",
  "words": [
    {
      "word": "EVENT",
      "fragments": [
        "EV",
        "ENT"
      ],
      "orientation": "vertical",
      "fact": "Events are specific user actions tracked in analytics systems. Examples include button clicks, page views, form submissions, or purchases. Event tracking enables understanding user behavior patterns, building funnels, and measuring feature adoption. Well-designed event schemas balance granularity with maintainability and privacy considerations."
    },
    {
      "word": "SESSION",
      "fragments": [
        "SESS",
        "ION"
      ],
      "orientation": "vertical",
      "fact": "A session represents a period of user activity, typically defined as actions within a specified timeframe before timeout. Session analysis reveals usage patterns, engagement depth, and user workflows. Metrics like sessions per user, session length, and actions per session indicate product stickiness and value delivery."
    },
    {
      "word": "SEGMENT",
      "fragments": [
        "SEGM",
        "ENT"
      ],
      "orientation": "vertical",
      "fact": "Segmentation groups users or data points by shared characteristics for analysis. Common segments include user demographics, behavior patterns, acquisition sources, or subscription tiers. Segmentation reveals how different groups use and value the product differently, enabling targeted improvements and personalized experiences."
    },
    {
      "word": "PROPERTY",
      "fragments": [
        "PROPER",
        "TY"
      ],
      "orientation": "vertical",
      "fact": "Properties are attributes attached to events or users that provide context for analysis. Event properties might include device type, location, or feature used. User properties include plan type, signup date, or engagement level. Properties enable filtering, segmentation, and understanding the 'why' behind metrics."
    },
    {
      "word": "QUERY",
      "fragments": [
        "QUE",
        "RY"
      ],
      "orientation": "vertical",
      "fact": "A query is a request for specific data from analytics systems. Queries combine events, properties, filters, and time ranges to answer questions about user behavior. Product managers should develop query literacy to self-serve insights, validate hypotheses, and make data-informed decisions independently."
    },
    {
      "word": "DASHBOARD",
      "fragments": [
        "DASHBO",
        "ARD"
      ],
      "orientation": "vertical",
      "fact": "A dashboard is a visual display of key metrics and trends in one place. Effective dashboards highlight what matters most, update automatically, and enable quick pattern recognition. Different dashboards serve different needs: executive summaries focus on business metrics, product dashboards track health metrics, and feature dashboards measure specific initiatives."
    }
  ]
}