{
  "title": "What are Defense-in-Depth layers?",
  "description": "Learn the multiple layers of security protection. From prevention through continuous monitoring.",
  "words": [
    {"word": "PREVENT", "fragments": ["PREV", "ENT"], "orientation": "vertical", "fact": "<strong>Prevent:</strong> Stopping attacks before they occur through firewalls, access controls, input validation, and security awareness training. Prevention is first line of defense. Patch management prevents exploitation of known vulnerabilities. Security architecture principles like least privilege reduce attack surface."},
    {"word": "WATCH", "fragments": ["WAT", "CH"], "orientation": "vertical", "fact": "<strong>Watch:</strong> Continuous observation of systems through logging, monitoring dashboards, and security cameras. SIEM aggregates logs for analysis. Network traffic analysis detects anomalies. Security operations centers (SOCs) provide 24/7 vigilance. Visibility is foundation of effective security."},
    {"word": "RESPOND", "fragments": ["RESP", "OND"], "orientation": "vertical", "fact": "<strong>Respond:</strong> Rapid reaction to security events—automated SOAR playbooks execute responses like blocking IPs, quarantining systems, and alerting analysts. Incident response teams follow documented procedures. Response speed determines breach impact—every minute counts during active attacks."},
    {"word": "RESTORE", "fragments": ["REST", "ORE"], "orientation": "vertical", "fact": "<strong>Restore:</strong> Returning to normal operations through verified clean backups and system rebuilds. Business continuity plans define restoration priorities. Test restoration procedures regularly. Immutable backups prevent ransomware from destroying recovery options. Document recovery steps for consistency."},
    {"word": "MONITOR", "fragments": ["MONI", "TOR"], "orientation": "vertical", "fact": "<strong>Monitor:</strong> Systematic observation and recording of security events for analysis. Continuous monitoring detects threats in real-time. Key metrics include failed login attempts, privilege escalations, and unusual data transfers. Compliance requirements often mandate specific monitoring and retention periods."},
    {"word": "SHIELD", "fragments": ["SHI", "ELD"], "orientation": "vertical", "fact": "<strong>Shield:</strong> Protective barrier deflecting attacks—web application firewalls (WAFs), intrusion prevention systems (IPS), anti-malware. Shields filter malicious traffic while allowing legitimate requests. Defense-in-depth uses multiple overlapping shields so single point failures don't compromise security."}
  ]
}
