{
  "title": "What are User Research Methods?",
  "description": "Understand the techniques used to gather user insights and validate ideas",
  "words": [
    {
      "word": "SURVEY",
      "fragments": [
        "SURV",
        "EY"
      ],
      "orientation": "vertical",
      "fact": "Surveys are structured questionnaires used to gather quantitative and qualitative data from a large number of users. They're cost-effective for collecting feedback at scale and can reveal patterns in user behavior, preferences, and needs. Well-designed surveys use clear questions, appropriate scales, and avoid leading or biased phrasing."
    },
    {
      "word": "PERSONA",
      "fragments": [
        "PERS",
        "ONA"
      ],
      "orientation": "vertical",
      "fact": "User personas are fictional characters that represent key user segments based on research data. They include demographics, goals, pain points, and behaviors. Personas help teams empathize with users and make decisions from the user's perspective. Effective personas are based on real data, not assumptions."
    },
    {
      "word": "TESTING",
      "fragments": [
        "TEST",
        "ING"
      ],
      "orientation": "vertical",
      "fact": "Usability testing involves observing users as they interact with a product to identify issues and opportunities for improvement. Testing can be moderated or unmoderated, in-person or remote. Key insights come from watching users struggle, succeed, or get confused, revealing problems that teams might not anticipate."
    },
    {
      "word": "EMPATHY",
      "fragments": [
        "EMPA",
        "THY"
      ],
      "orientation": "vertical",
      "fact": "Empathy is the ability to understand and share users' feelings, needs, and perspectives. Empathy mapping is a collaborative tool that helps teams develop deeper insights into users' thoughts, feelings, actions, and pain points. Building empathy is foundational to creating products that genuinely solve user problems."
    },
    {
      "word": "INSIGHT",
      "fragments": [
        "INS",
        "IGHT"
      ],
      "orientation": "vertical",
      "fact": "User insights are deep understandings of user needs, behaviors, and motivations derived from research data. They go beyond surface observations to reveal underlying reasons why users behave certain ways. Powerful insights often challenge assumptions and inspire innovative solutions that truly resonate with users."
    },
    {
      "word": "FEEDBACK",
      "fragments": [
        "FEED",
        "BACK"
      ],
      "orientation": "vertical",
      "fact": "User feedback is direct input from customers about their experience with a product. It can be collected through surveys, interviews, support tickets, reviews, or analytics. Regular feedback loops help teams validate decisions, catch issues early, and continuously improve products based on real user needs."
    }
  ]
}